# IFCHybrid Import Update Elements(Document, String, IFCHybrid Import Options) Method

Source: https://www.revitapidocs.com/2026/be5a0dc9-8c39-fdda-6555-b08ddf4864e1.htm

---

| IFCHybrid Import Update Elements(Document, String, IFCHybrid Import Options) Method |
| --- |

Updates IFC Elements using AnyCAD.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<ElementId> UpdateElements(
	Document doc,
	string file,
	IFCHybridImportOptions options
)
```

```
Public Function UpdateElements (
	doc As Document,
	file As String,
	options As IFCHybridImportOptions
) As IList(Of ElementId)
```

```
public:
IList<ElementId^>^ UpdateElements(
	Document^ doc,
	String^ file,
	IFCHybridImportOptions^ options
)
```

```
member UpdateElements :
        doc : Document *
        file : string *
        options : IFCHybridImportOptions -> IList<ElementId>
```

#### Parameters

doc Document
:   Document to receive elements from the IFC file update.

file String
:   Full path of the file to import.

options IFCHybridImportOptions
:   The hybrid import options.

#### Return Value

IList ElementId
Returns an array of ElementIds representing created or updated elements. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCHybridImport Class UpdateElements Overload Autodesk.Revit.DB.IFC Namespace